### Package Import

In [2]:
import pandas as pd
import numpy as np

### 파일에서 읽어오기

#### DataFrame
- 2차원구조
- index, columns, values
![파일읽기](https://pandas.pydata.org/docs/_images/02_io_readwrite.svg)

In [7]:
# ../  : 상위 디렉터리
# ./ : 현재 디렉터리
# 디렉토리명/ : 하위 디렉터리
data = pd.read_csv('./files/data/sample1.csv')
display(data)
data.head(n=3)

         ID pname       birth dept   영어  일본어  중국어
0  18030201   홍길동  1990-01-23  연구소  1.0  1.0  NaN
1  18030202   전우치  1992-10-11  마케팅  NaN  2.0  NaN
2  19030401   사오정  1995-07-02  연구소  1.0  NaN  NaN
3  19070101   손오공  1990-11-23  연구소  NaN  NaN  3.0
4  19070102   임꺽정  1993-02-01  마케팅  NaN  NaN  NaN
5  19070103   저팔계  1992-07-16  연구소  NaN  NaN  1.0

         ID pname       birth dept   영어  일본어  중국어
0  18030201   홍길동  1990-01-23  연구소  1.0  1.0  NaN
1  18030202   전우치  1992-10-11  마케팅  NaN  2.0  NaN
2  19030401   사오정  1995-07-02  연구소  1.0  NaN  NaN

#### DataFrame
    - index, columns, values
    - index(row), columns(column) => Index type, DataFrame은 2개의 Index 사용
    - values => ndarray type

In [8]:
data.index

RangeIndex(start=0, stop=6, step=1)

In [9]:
data.columns

Index(['ID', 'pname', 'birth', 'dept', '영어', '일본어', '중국어'], dtype='object')

In [10]:
data.values

array([[18030201, '홍길동', '1990-01-23', '연구소', 1.0, 1.0, nan],
       [18030202, '전우치', '1992-10-11', '마케팅', nan, 2.0, nan],
       [19030401, '사오정', '1995-07-02', '연구소', 1.0, nan, nan],
       [19070101, '손오공', '1990-11-23', '연구소', nan, nan, 3.0],
       [19070102, '임꺽정', '1993-02-01', '마케팅', nan, nan, nan],
       [19070103, '저팔계', '1992-07-16', '연구소', nan, nan, 1.0]],
      dtype=object)

In [ ]:
df2 = pd.read_csv('files/data/sample1.csv', index_col="ID")
df2

In [ ]:
df2.index

In [ ]:
df2.columns

In [ ]:
df2.values
# 앞의 index가 사라진 것을 알 수 있다.

#### 엑셀 파일을 읽어 DataFrame 객체 반환
    -index_col 지정시 column 번호를 사용하거나 lable을 사용할 수 있음

In [ ]:
df3 = pd.read_excel('files/data/sample1.xlsx', index_col=1) # 원래 index 는 자동 생성 된다
df3

In [11]:
data.columns.to_list()
names = data.columns.to_list()
names

['ID', 'pname', 'birth', 'dept', '영어', '일본어', '중국어']

In [12]:
df4 = pd.read_table('./files/data/sample1.txt', sep=",", names=names)
df4
# sep : 구분자 !!
# names : 컬럼명 리스트 !!

         ID pname       birth dept   영어  일본어  중국어
0  18030201   홍길동  1990-01-23  연구소  1.0  1.0  NaN
1  18030202   전우치  1992-10-11  마케팅  NaN  2.0  NaN
2  19030401   사오정  1995-07-02  연구소  1.0  NaN  NaN
3  19070101   손오공  1990-11-23  연구소  NaN  NaN  3.0
4  19070102   임꺽정  1993-02-01  마케팅  NaN  NaN  NaN
5  19070103   저팔계  1992-07-16  연구소  NaN  NaN  1.0

### DataFrame 속성 확인하기

In [ ]:
df4.head()

In [ ]:
df4.tail(3)

In [ ]:
df4.columns # read / write 둘다 기능 가능
df4.index

In [ ]:
df4.index=list('ABCDEF')
display(df4)

In [ ]:
df4.columns = list('ibdejc')

In [ ]:
df1.columns = ['사번', '이름', '생일','부서', '영어', '일본어', '중국어']
display(df1)

### Series 속성 확인하기

In [ ]:
data = df1
data['영어'].index

In [ ]:
print(data['영어'].index)
print(data['영어'].index.values)
print(data['영어'].values)

### Index객체 확인

In [ ]:
a = pd.RangeIndex(10)
a

### 메모리사용

In [ ]:
data = pd.read_csv("./files/data/sample1.csv", index_col="ID")
display(data)

In [ ]:
print(data.memory_usage(index=True, deep=True), end='\n')
# deep=True 를해야, value의 메모리 사용량을 알 수있다.

### dtype 변경

#### x.describe()
- x.describe(percentiles=None, ...)
- DataFrame/Series의 숫자 형 변수에 대한 여러 가지 통계량 출력
- 개수, 평균값, 표준편차, 최솟값, 1, 2 (중앙값), 3사분위 수, 최대값
- percentiles : 새로운 index 생성에 사용할 column/column 목록(columns labels로 작성)

In [18]:
col_name = ['학번', '국어', '영어', '수학', 'Java', 'C']

In [20]:
score = pd.read_csv("./files/data/score.csv", names=col_name)
score

   번호   국어  영어  수학  Java   C
0   1   85  96  75    77  89
1   2   89  85  74    76  56
2   3   90  63  95    75  99
3   4  100  45  89    78  88
4   5   63  56  99    90  85
5   6   75  65  78    89  24
6   7   56  78  12    36  98
7   8   85  77  45    63  89
8   9   55  74  89    54  69
9  10   98  71  75    86  77

![IQR](https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Boxplot_vs_PDF.svg/800px-Boxplot_vs_PDF.svg.png)

In [21]:
score.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   번호      10 non-null     int64
 1   국어      10 non-null     int64
 2   영어      10 non-null     int64
 3   수학      10 non-null     int64
 4   Java    10 non-null     int64
 5   C       10 non-null     int64
dtypes: int64(6)
memory usage: 608.0 bytes

In [22]:
score.describe()

             번호          국어         영어         수학       Java          C
count  10.00000   10.000000  10.000000  10.000000  10.000000  10.000000
mean    5.50000   79.600000  71.000000  73.100000  72.400000  77.400000
std     3.02765   16.560998  14.590712  26.269754  16.978418  22.877451
min     1.00000   55.000000  45.000000  12.000000  36.000000  24.000000
25%     3.25000   66.000000  63.500000  74.250000  66.000000  71.000000
50%     5.50000   85.000000  72.500000  76.500000  76.500000  86.500000
75%     7.75000   89.750000  77.750000  89.000000  84.000000  89.000000
max    10.00000  100.000000  96.000000  99.000000  90.000000  99.000000

### Series 생성, 메서드, 연산

#### 6-1. Series 생성
- pd.Series(data=None, index=None, dtype=None, name=None, copy=False, ... )
- 1) data : array-like, iterable, dict or scalar value 등을 사용할 수 있음
- 2) index : array-like or Index (1D)
   - index.values 는 hashable 객체이어야 하며, data와 같은 길이어야 함 
   - 생략 시 RangeIndex가 사용됨 (0 부터 1씩 증가하는 숫자 values)
   - data가 dict 객체일때 index가 생략되면, dict 객체의 key를 index로 사용
   - dict 객체의 key와 index가 중복되면 index를 따름 (dict의 key가 갱신 됨) 
- 3) dtype : Series.values 의 데이터 타입
   - str, numpy.dtype, ExtensionDtype 등을 사용할 수 있음
- 4) name : Series.name으로 사용할 것으로 문자열로 지정함
- 5) copy : 입력 데이터를 복사하는지에 대한 여부 (ndarray 에만 적용)
   - True 인 경우 복사(다른 메모리 사용), False라도 dtype이 다르면 복사함

#### Series의 메서드
- pandas 의 함수/메서드 들은 일반적으로 NaN에 대해 제외하고 처리한다 (numpy 와 다름)
- s.sum() : NaN을 제외한 데이터 합계 구하기, float 반환
- s.count() : NaN을 제외한 데이터 개수 구하기, int 반환
- s.mean() : NaN을 제외한 데이터 평균 구하기, float 반환
- s.unique() : 중복 데이터를 제외한 데이터의 ndarray로 반환 (NaN 포함)
- s.value_counts() : NaN을 제외한 각 데이터의 개수(정수)의 Series 반환
- s.head(숫자), s.tail(숫자) : 데이터를 상위/하위 숫자 개 만큼의 Series 반환
- s.to_list() : s.values를 list 객체로 반환
- s.to_numpy([dtype, copy]) : s.values를 ndarray 객체로 반환

In [23]:
s1= pd.Series([4, 2, 3, 3, np.nan, np.nan, 6, 7, 8, 7, 7], dtype=np.float64)
s1

0     4.0
1     2.0
2     3.0
3     3.0
4     NaN
5     NaN
6     6.0
7     7.0
8     8.0
9     7.0
10    7.0
dtype: float64

In [33]:
print("unique() :", s1.unique(), type(s1.unique()))
print("value_counts() :")
print(s1.value_counts())

print("sum() :", s1.sum())
print("mean() :", s1.mean())
print("count() :", s1.count())

unique() : [ 4.  2.  3. nan  6.  7.  8.] <class 'numpy.ndarray'>
value_counts() :
7.0    3
3.0    2
6.0    1
4.0    1
8.0    1
2.0    1
dtype: int64
47.0
5.222222222222222
9

#### Series의 연산
- index를 기준으로 연산된다
- Series 와 Series 의 연산은 같은 index의 value 끼리 연산 된다
    - 같은 index가 없는 경우, 추가되며 결과는 NaN이다
    
- Series 와 스칼라 의 연산은 각 원소별로 스칼라와 연산 된다
    - 스칼라가 broadcasting 되어 사용된다

In [45]:
x = np.arange(1, 6)
y = np.arange(6 ,11)

s2 = pd.Series(x)
s3 = pd.Series(y)

print(s2, s3, s2+s3, sep="\n")

s2

a    1
b    2
c    3
d    4
e    5
dtype: int32

In [51]:
x = np.arange(1, 6)
y = np.arange(6 ,10)

nx = ['a', 'b', 'c', 'd', 'e']
ny = ['a', 'x', 'y', 'z']

s2 = pd.Series(x, nx)
s3 = pd.Series(y, ny)
s4 = s2.add(s3, fill_value=0).astype(np.int32)

print(s2+s3, sep="\n")
print(s4)

a    7.0
b    NaN
c    NaN
d    NaN
e    NaN
x    NaN
y    NaN
z    NaN
dtype: float64
a    7
b    2
c    3
d    4
e    5
x    7
y    8
z    9
dtype: int32

### DataFrame 생성, 메서드, 연산

#### DataFrame 생성
- pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)
- data : ndarray(structured or homogeneous), Iterable, dict, DataFrame
   - dict 사용시 columns가 지정되지 않으면 dict의 key가 columns로 사용됨
   - DataFrame 사용시 data, index, columns 가 복사 됨
- index, columns : array-like or Index (1D)
   - 생략 시 RangeIndex가 사용됨 (0 부터 1씩 증가하는 숫자 values)
   - index.values 는 hashable 객체이어야 함
   - data로 dict 사용시, dict 의 key 와 columns가 중복될 경우 columns를 따름
   - data로 ndarray 사용시 index.values 개수 == data 행 개수
   - data로 ndarray 사용시 columns.values 개수 == data 열 개수
- dtype : 직접 데이터 타입을 지정하며, 1개의 타입 지정만 가능함
- copy : ndarray(2D), DataFrame을 data로 사용시 copy=False는 연결을 의미함
   - ndarray의 dtype이나, DataFrame의 index, columns 등이 변경이 되면 copy=True로 동작함

#### DataFrame의 연산
- DataFrame 끼리의 연산은 index와 columns를 모두 대상으로 한다
- df + df 의 경우 match 되는 index 나 column 이 없는 경우 NaN 으로 결과가 표시된다

- DataFrame + Series은 DataFrame의 column, Series의 index에 맞춰 연산 된다
- Series가 DataFrame의 row 개수에 맞춰 broadcasting 되어 사용된다
- match 되는 index 가 없는 경우 결과는 NaN 이다

- DataFrame  + Scalar는 각 원소별로 스칼라와 연산 된다
- 스칼라가 broadcasting 되어 사용된다

#### [ 연습 ] employees 데이터 확인

In [64]:
# 파일 로드
emp = pd.read_csv("./files/data/employees.csv")
display(emp)

         사번   이름        생년월일   부서 영어등급  일본어등급 중국어등급      급여      초과근무
0  18030201  임꺽정  1990-01-23  연구부    1    1.0         3,456  23:10:10
1  18030202  손오공  1992-10-11  마케팅         2.0   NaN   4,320  10:15:17
2  19030401  전우치  1995-07-02  연구부    1    NaN   NaN   5,600  16:21:10
3  19070101  홍길동  1990-11-23  연구부  NaN    NaN     3   4,500  15:00:20
4  19070102  사오정  1993-02-01  마케팅  NaN    NaN   NaN   3,150  21:19:50
5  19070103  저팔계  1992-07-16  연구부  NaN    NaN     1   4,200  14:10:40
6  19080101  김유신  1993-04-11  총무부    2    NaN   NaN   4,800   9:50:30
7  19080102  강감찬  1991-12-07  영업부    1    1.0     1  10,100   8:40:40
8  19090201  이순신  1992-06-16  영업부    3    1.0     2   6,840  17:30:20
9  19090202   권율  1993-05-05  연구부  NaN    3.0     1   4,750  19:50:20

In [61]:
# 정보
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   사번      10 non-null     int64
 1   이름      10 non-null     object
 2   생년월일    10 non-null     object
 3   부서      10 non-null     object
 4   영어등급    6 non-null      object
 5   일본어등급   5 non-null      float64
 6   중국어등급   6 non-null      object
 7   급여      10 non-null     object
 8   초과근무    10 non-null     object
dtypes: float64(1), int64(1), object(7)
memory usage: 848.0+ bytes

In [65]:
# 부서의 인원 확인
emp.value_counts('부서')

부서
연구부    5
마케팅    2
영업부    2
총무부    1
dtype: int64

In [78]:
# 영어 등급의 NaN 개수 확인
# 전처리 해야 한다 : 공백을 replace 로 날려 버려야 한다구 ~
print(emp['영어등급'].isnull())
print(emp['영어등급'].isnull().sum())
print(emp['영어등급'].isna().sum())
print(emp['영어등급'].count())

0    False
1    False
2    False
3     True
4     True
5     True
6    False
7    False
8    False
9     True
Name: 영어등급, dtype: bool
4
4
6

### DataFrame, Series의 삽입, 삭제, 갱신

#### Series 추가, 갱신, 삭제

#### DataFrame 추가, 갱신, 삭제
- 추가, 갱신 : 항의 개수가 같아야 함
    - column 단위로 추가, 갱신 작업
- df['column_label']=1D array
   - 'column_label'에 해당하는 column 갱신 또는  추가
   - read /write용으로 모두 사용
- df.column_label
   - read 용으로 사용

In [79]:
ID = [123, 445, 346, 135]
name = ['Coffee', 'IS', 'Always', 'Right']
data = {
    'name': name
    ,'kor' : [90, 80, 70, 65]
    ,'eng' : [95, 100, 88, 76]
}

df = pd.DataFrame(data, index=ID)
display(df)

       name  kor  eng
123  Coffee   90   95
445      IS   80  100
346  Always   70   88
135   Right   65   76

In [94]:
df['kor'] = [100, 15, 25, 45]
display(df)
df['math'] = [68, 79, 83, 60]
display(df)

       name  kor  eng
123  Coffee  100   95
445      IS   15  100
346  Always   25   88
135   Right   45   76

       name  kor  eng  math
123  Coffee  100   95    68
445      IS   15  100    79
346  Always   25   88    83
135   Right   45   76    60

In [95]:
del df['math']
display(df)

       name  kor  eng
123  Coffee  100   95
445      IS   15  100
346  Always   25   88
135   Right   45   76

### Index 조작

#### set_index
- df.set_index(keys, drop=True,  append=False, inplace=False)
- 선택된 columns의 일부로 새로 구성한 index 를 갖는 DataFrame 반환
- keys : 새로운 index 생성에 사용할 column/column 목록(columns labels로 작성)
- drop : keys를 columns 로 부터 제거 여부 (default True => 제거함)
- append : 기존 index를 유지하면서 keys를 추가 여부 (default False => 유지하지 않음)

In [1]:
import numpy as np
import pandas as pd

In [111]:
# pd.read_csv?
index_test = pd.read_csv('./files/data/index_test.csv', encoding='cp949', index_col='이름')
display(index_test)
index_test.head(3)

      부서  성별  나이    급여
이름
임꺽순  연구부  여자  36  4700
손오공  마케팅  남자  35  4320
전우희  연구부  여자  29  5600
홍길순  연구부  여자  33  4500
사오정  마케팅  남자  30  3150
저팔계  연구부  남자  41  7000
김유신  총무부  남자  29  4800
강아지  영업부  여자  42  7530
이순신  영업부  남자  31  6840
권율   연구부  남자  32  4750

      부서  성별  나이    급여
이름
임꺽순  연구부  여자  36  4700
손오공  마케팅  남자  35  4320
전우희  연구부  여자  29  5600

In [118]:
index_test1 = index_test.set_index('부서')
display(index_test1)

     성별  나이    급여
부서
연구부  여자  36  4700
마케팅  남자  35  4320
연구부  여자  29  5600
연구부  여자  33  4500
마케팅  남자  30  3150
연구부  남자  41  7000
총무부  남자  29  4800
영업부  여자  42  7530
영업부  남자  31  6840
연구부  남자  32  4750

In [119]:
index_test2 = index_test.set_index('부서', drop=False)
display(index_test2)

      부서  성별  나이    급여
부서
연구부  연구부  여자  36  4700
마케팅  마케팅  남자  35  4320
연구부  연구부  여자  29  5600
연구부  연구부  여자  33  4500
마케팅  마케팅  남자  30  3150
연구부  연구부  남자  41  7000
총무부  총무부  남자  29  4800
영업부  영업부  여자  42  7530
영업부  영업부  남자  31  6840
연구부  연구부  남자  32  4750

In [120]:
index_test3 = index_test2.set_index('성별', append=True)
display(index_test3) # multi index

         부서  나이    급여
부서  성별
연구부 여자  연구부  36  4700
마케팅 남자  마케팅  35  4320
연구부 여자  연구부  29  5600
    여자  연구부  33  4500
마케팅 남자  마케팅  30  3150
연구부 남자  연구부  41  7000
총무부 남자  총무부  29  4800
영업부 여자  영업부  42  7530
    남자  영업부  31  6840
연구부 남자  연구부  32  4750

In [122]:
index_test4 = index_test.set_index(['부서', '성별'], append=True)
display(index_test4)

            나이    급여
이름  부서  성별
임꺽순 연구부 여자  36  4700
손오공 마케팅 남자  35  4320
전우희 연구부 여자  29  5600
홍길순 연구부 여자  33  4500
사오정 마케팅 남자  30  3150
저팔계 연구부 남자  41  7000
김유신 총무부 남자  29  4800
강아지 영업부 여자  42  7530
이순신 영업부 남자  31  6840
권율  연구부 남자  32  4750

#### reset_index
- df.reset_index( level=None,  drop=False, ...) : 
- 현 index를 columns에 포함하여 새로 구성한 index를 갖는 DataFrame 반환 
- level :int, str, tuple or list 로 작성 (None 이면 모든 index를 대상으로 함)
   - 현 index 중 columns 로 포함 할 대상을 번호 또는 name으로 지정함
   - 모든 index가 columns로 포함되면 RangeIndex가 새로운 Index로 생성됨
- drop : 현 index를 columns 로 포함하지 않을 지의 여부 (drop=True : 포함 안함)

In [123]:
# pd.read_csv?
index_test = pd.read_csv('./files/data/index_test.csv', encoding='cp949', index_col='이름')
display(index_test)
index_test.head(3)

      부서  성별  나이    급여
이름
임꺽순  연구부  여자  36  4700
손오공  마케팅  남자  35  4320
전우희  연구부  여자  29  5600
홍길순  연구부  여자  33  4500
사오정  마케팅  남자  30  3150
저팔계  연구부  남자  41  7000
김유신  총무부  남자  29  4800
강아지  영업부  여자  42  7530
이순신  영업부  남자  31  6840
권율   연구부  남자  32  4750

      부서  성별  나이    급여
이름
임꺽순  연구부  여자  36  4700
손오공  마케팅  남자  35  4320
전우희  연구부  여자  29  5600

In [126]:
index_test5 = index_test.reset_index(0)
display(index_test5)

    이름   부서  성별  나이    급여
0  임꺽순  연구부  여자  36  4700
1  손오공  마케팅  남자  35  4320
2  전우희  연구부  여자  29  5600
3  홍길순  연구부  여자  33  4500
4  사오정  마케팅  남자  30  3150
5  저팔계  연구부  남자  41  7000
6  김유신  총무부  남자  29  4800
7  강아지  영업부  여자  42  7530
8  이순신  영업부  남자  31  6840
9   권율  연구부  남자  32  4750

In [134]:
display(index_test4)
display(index_test4.reset_index(1))
display(index_test4.reset_index([0,1,2]))
index_test4.index

            나이    급여
이름  부서  성별
임꺽순 연구부 여자  36  4700
손오공 마케팅 남자  35  4320
전우희 연구부 여자  29  5600
홍길순 연구부 여자  33  4500
사오정 마케팅 남자  30  3150
저팔계 연구부 남자  41  7000
김유신 총무부 남자  29  4800
강아지 영업부 여자  42  7530
이순신 영업부 남자  31  6840
권율  연구부 남자  32  4750

         부서  나이    급여
이름  성별
임꺽순 여자  연구부  36  4700
손오공 남자  마케팅  35  4320
전우희 여자  연구부  29  5600
홍길순 여자  연구부  33  4500
사오정 남자  마케팅  30  3150
저팔계 남자  연구부  41  7000
김유신 남자  총무부  29  4800
강아지 여자  영업부  42  7530
이순신 남자  영업부  31  6840
권율  남자  연구부  32  4750

    이름   부서  성별  나이    급여
0  임꺽순  연구부  여자  36  4700
1  손오공  마케팅  남자  35  4320
2  전우희  연구부  여자  29  5600
3  홍길순  연구부  여자  33  4500
4  사오정  마케팅  남자  30  3150
5  저팔계  연구부  남자  41  7000
6  김유신  총무부  남자  29  4800
7  강아지  영업부  여자  42  7530
8  이순신  영업부  남자  31  6840
9   권율  연구부  남자  32  4750

MultiIndex([('임꺽순', '연구부', '여자'),
            ('손오공', '마케팅', '남자'),
            ('전우희', '연구부', '여자'),
            ('홍길순', '연구부', '여자'),
            ('사오정', '마케팅', '남자'),
            ('저팔계', '연구부', '남자'),
            ('김유신', '총무부', '남자'),
            ('강아지', '영업부', '여자'),
            ('이순신', '영업부', '남자'),
            ( '권율', '연구부', '남자')],
           names=['이름', '부서', '성별'])

In [135]:
test_origin = pd.read_csv('./files/data/index_test.csv', encoding='cp949')

#### sort_index
- df.sort_index(axis=0, level=None, ascending=True, inplace=False,kind='quicksort', na_position=‘last’, ...)
- 축에 따른 index labels를 기준으로 대상을 정렬하는 메서드이다
- <span style="color:red">axis</span> : 정렬 축 지정, DataFrame은 0, 1 Series은 0을 사용할 수 있음
- level : int, level-name, list of int or level-names
    - MultiIndex 에서 정렬 기준으로 사용할 level을 지정 함
- <span style="color:red">ascending</span> : True: 오름차순 정렬, False: 내림차순 정렬, list of boolean
- inplace : True인 경우 객체를 직접 수정하고 None 반환
- kind : 정렬 알고리즘 지정 {'quicksort', 'mergesort', 'heapsort'}
- na_position : NA value의 위치, {'first', 'last'}

In [137]:
test1 = test_origin.set_index('이름')
display(test1)

      부서  성별  나이    급여
이름
임꺽순  연구부  여자  36  4700
손오공  마케팅  남자  35  4320
전우희  연구부  여자  29  5600
홍길순  연구부  여자  33  4500
사오정  마케팅  남자  30  3150
저팔계  연구부  남자  41  7000
김유신  총무부  남자  29  4800
강아지  영업부  여자  42  7530
이순신  영업부  남자  31  6840
권율   연구부  남자  32  4750

In [144]:
# test2 = test1.sort_index(ascending=False)
test2 = test1.sort_index()
display(test2)

      부서  성별  나이    급여
이름
강아지  영업부  여자  42  7530
권율   연구부  남자  32  4750
김유신  총무부  남자  29  4800
사오정  마케팅  남자  30  3150
손오공  마케팅  남자  35  4320
이순신  영업부  남자  31  6840
임꺽순  연구부  여자  36  4700
저팔계  연구부  남자  41  7000
전우희  연구부  여자  29  5600
홍길순  연구부  여자  33  4500

In [145]:
display(test1)
test1.sort_index(axis=1) # 컬럼 기준

      부서  성별  나이    급여
이름
임꺽순  연구부  여자  36  4700
손오공  마케팅  남자  35  4320
전우희  연구부  여자  29  5600
홍길순  연구부  여자  33  4500
사오정  마케팅  남자  30  3150
저팔계  연구부  남자  41  7000
김유신  총무부  남자  29  4800
강아지  영업부  여자  42  7530
이순신  영업부  남자  31  6840
권율   연구부  남자  32  4750

       급여  나이   부서  성별
이름
임꺽순  4700  36  연구부  여자
손오공  4320  35  마케팅  남자
전우희  5600  29  연구부  여자
홍길순  4500  33  연구부  여자
사오정  3150  30  마케팅  남자
저팔계  7000  41  연구부  남자
김유신  4800  29  총무부  남자
강아지  7530  42  영업부  여자
이순신  6840  31  영업부  남자
권율   4750  32  연구부  남자

In [149]:
test3 = test_origin.set_index(['부서','성별'])
display(test3)

         이름  나이    급여
부서  성별
연구부 여자  임꺽순  36  4700
마케팅 남자  손오공  35  4320
연구부 여자  전우희  29  5600
    여자  홍길순  33  4500
마케팅 남자  사오정  30  3150
연구부 남자  저팔계  41  7000
총무부 남자  김유신  29  4800
영업부 여자  강아지  42  7530
    남자  이순신  31  6840
연구부 남자   권율  32  4750

In [154]:
test3.sort_index(level = ['부서','성별'], ascending = [False, False])

         이름  나이    급여
부서  성별
총무부 남자  김유신  29  4800
영업부 여자  강아지  42  7530
    남자  이순신  31  6840
연구부 여자  임꺽순  36  4700
    여자  전우희  29  5600
    여자  홍길순  33  4500
    남자  저팔계  41  7000
    남자   권율  32  4750
마케팅 남자  손오공  35  4320
    남자  사오정  30  3150

### [ 복습 ]

In [ ]:
test00 = pd.read_csv('./files/data/index_test.csv'
                    ,encoding='cp949'
                    ,index_col ='이름')
test00

In [ ]:
sort01 = test00.sort_index()
display(sort01)

In [ ]:
sort02 = test00.sort_index(ascending=False)
display(sort02)

In [ ]:
sort03 = test00.sort_index(axis=1)
display(sort03)

In [ ]:
test00.reset_index(inplace=True)
display(test00)

In [ ]:
# display(test00.reset_index())
set01 = test00.set_index(['부서', '성별'])
display(set01)

In [ ]:
sort02 = set01.sort_index(level=['부서','성별']
                        ,ascending=[False, False])

display(sort02)

In [ ]:
sort03 = set01.sort_index(level=['부서','성별']
                        ,ascending=[True, False])

#### sort_values
- df.sort_values(by, axis=0, ascending=True, inplace=False,kind='quicksort’, na_position='last')
- 축에 따른 by 목록의 values를 기준으로 대상을 정렬하여 반환한다
- by : str 또는 list of str을 사용하여 정렬 기준이 되는 이름 또는 이름 목록 지정
- axis=0 : column labels, axis=1 : index labels를 사용하여 이름 목록 작성
- axis=1 사용을 위해서는 모든 columns의 dtype이 동일해야 함(거의 사용 안함)

In [13]:
df = pd.read_csv('./files/data/employees.csv')
display(df)

         사번   이름        생년월일   부서 영어등급  일본어등급 중국어등급      급여      초과근무
0  18030201  임꺽정  1990-01-23  연구부    1    1.0         3,456  23:10:10
1  18030202  손오공  1992-10-11  마케팅         2.0   NaN   4,320  10:15:17
2  19030401  전우치  1995-07-02  연구부    1    NaN   NaN   5,600  16:21:10
3  19070101  홍길동  1990-11-23  연구부  NaN    NaN     3   4,500  15:00:20
4  19070102  사오정  1993-02-01  마케팅  NaN    NaN   NaN   3,150  21:19:50
5  19070103  저팔계  1992-07-16  연구부  NaN    NaN     1   4,200  14:10:40
6  19080101  김유신  1993-04-11  총무부    2    NaN   NaN   4,800   9:50:30
7  19080102  강감찬  1991-12-07  영업부    1    1.0     1  10,100   8:40:40
8  19090201  이순신  1992-06-16  영업부    3    1.0     2   6,840  17:30:20
9  19090202   권율  1993-05-05  연구부  NaN    3.0     1   4,750  19:50:20

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   사번      10 non-null     int64
 1   이름      10 non-null     object
 2   생년월일    10 non-null     object
 3   부서      10 non-null     object
 4   영어등급    6 non-null      object
 5   일본어등급   5 non-null      float64
 6   중국어등급   6 non-null      object
 7   급여      10 non-null     object
 8   초과근무    10 non-null     object
dtypes: float64(1), int64(1), object(7)
memory usage: 848.0+ bytes

In [17]:
df1 = df.sort_values(by='이름')
display(df1)

         사번   이름        생년월일   부서 영어등급  일본어등급 중국어등급      급여      초과근무
7  19080102  강감찬  1991-12-07  영업부    1    1.0     1  10,100   8:40:40
9  19090202   권율  1993-05-05  연구부  NaN    3.0     1   4,750  19:50:20
6  19080101  김유신  1993-04-11  총무부    2    NaN   NaN   4,800   9:50:30
4  19070102  사오정  1993-02-01  마케팅  NaN    NaN   NaN   3,150  21:19:50
1  18030202  손오공  1992-10-11  마케팅         2.0   NaN   4,320  10:15:17
8  19090201  이순신  1992-06-16  영업부    3    1.0     2   6,840  17:30:20
0  18030201  임꺽정  1990-01-23  연구부    1    1.0         3,456  23:10:10
5  19070103  저팔계  1992-07-16  연구부  NaN    NaN     1   4,200  14:10:40
2  19030401  전우치  1995-07-02  연구부    1    NaN   NaN   5,600  16:21:10
3  19070101  홍길동  1990-11-23  연구부  NaN    NaN     3   4,500  15:00:20

In [20]:
# 일본어 등급을 기준으로 내림차순, 그다음 이름, na 는 마지막으로
df2 = df.sort_values(by=["일본어등급", '이름']
                    ,ascending=[False, True]
                    ,na_position='last')
display(df2)

         사번   이름        생년월일   부서 영어등급  일본어등급 중국어등급      급여      초과근무
9  19090202   권율  1993-05-05  연구부  NaN    3.0     1   4,750  19:50:20
1  18030202  손오공  1992-10-11  마케팅         2.0   NaN   4,320  10:15:17
7  19080102  강감찬  1991-12-07  영업부    1    1.0     1  10,100   8:40:40
8  19090201  이순신  1992-06-16  영업부    3    1.0     2   6,840  17:30:20
0  18030201  임꺽정  1990-01-23  연구부    1    1.0         3,456  23:10:10
6  19080101  김유신  1993-04-11  총무부    2    NaN   NaN   4,800   9:50:30
4  19070102  사오정  1993-02-01  마케팅  NaN    NaN   NaN   3,150  21:19:50
5  19070103  저팔계  1992-07-16  연구부  NaN    NaN     1   4,200  14:10:40
2  19030401  전우치  1995-07-02  연구부    1    NaN   NaN   5,600  16:21:10
3  19070101  홍길동  1990-11-23  연구부  NaN    NaN     3   4,500  15:00:20

### Indexing
- index를 사용하여 원하는 내용(values)에 접근하는 방법
- 접근하여 읽기, 쓰기 등의 작업을 함
- https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html  
- indexing의 종류
  - Basic Indexing : 1개 indexer 사용
  - Multi-axis Indexing : axis 별 indexer 사용
      - Selection by Label : label을 사용함
      - Selection by Position : integer를 사용함
- indexer의 종류
  - a single label/integer : 1개의 label 또는 integer
  - a list or array of labels/integers : label 또는 integer의 리스트 또는 배열
  - a slice object with labels/integers : label 또는 integer의 slice (start:stop:step)
  - a boolean array : True/False로 이루어진 boolean type의 배열 (배열의 요소수는 index의 요소수와 동일해야 함)
  - a collable function with one argument (다루지 않음)

#### 10-1 Basic Indexing
- indexer를 1개만 사용하는 indexing
- Series의 경우 labels/integers를 모두 사용할 수 있음
- DataFrame의 경우 종류에 따라 기준이 되는 axis와 labels/integers 의 사용이 다름

In [3]:
import numpy as np
import pandas as pd

In [12]:
emp = pd.read_csv('./files/data/employees.csv', index_col='사번')

In [5]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10 entries, 18030201 to 19090202
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      10 non-null     object
 1   생년월일    10 non-null     object
 2   부서      10 non-null     object
 3   영어등급    6 non-null      object
 4   일본어등급   5 non-null      float64
 5   중국어등급   6 non-null      object
 6   급여      10 non-null     object
 7   초과근무    10 non-null     object
dtypes: float64(1), object(7)
memory usage: 720.0+ bytes

In [15]:
# 전처리 작업 : 데이터 타입 변경
# to_XXX, astype, to_timedelta(), to_datetime()

emp['생년월일'] = pd.to_datetime(emp['생년월일'])
emp['초과근무'] = pd.to_timedelta(emp['초과근무'])
emp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10 entries, 18030201 to 19090202
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      10 non-null     object
 1   생년월일    10 non-null     datetime64[ns]
 2   부서      10 non-null     object
 3   영어등급    6 non-null      object
 4   일본어등급   5 non-null      float64
 5   중국어등급   6 non-null      object
 6   급여      10 non-null     object
 7   초과근무    10 non-null     timedelta64[ns]
dtypes: datetime64[ns](1), float64(1), object(5), timedelta64[ns](1)
memory usage: 720.0+ bytes

In [16]:
# na처리 ==> nan을 0으로 치환
# replace(원본, 수정값) ==> regex

emp = emp.replace(' ', 0, regex=True)
emp = emp.replace(np.nan, 0)
display(emp)
emp.info()

           이름       생년월일   부서 영어등급  일본어등급 중국어등급      급여            초과근무
사번
18030201  임꺽정 1990-01-23  연구부    1    1.0     0   3,456 0 days 23:10:10
18030202  손오공 1992-10-11  마케팅    0    2.0     0   4,320 0 days 10:15:17
19030401  전우치 1995-07-02  연구부    1    0.0     0   5,600 0 days 16:21:10
19070101  홍길동 1990-11-23  연구부    0    0.0     3   4,500 0 days 15:00:20
19070102  사오정 1993-02-01  마케팅    0    0.0     0   3,150 0 days 21:19:50
19070103  저팔계 1992-07-16  연구부    0    0.0     1   4,200 0 days 14:10:40
19080101  김유신 1993-04-11  총무부    2    0.0     0   4,800 0 days 09:50:30
19080102  강감찬 1991-12-07  영업부    1    1.0     1  10,100 0 days 08:40:40
19090201  이순신 1992-06-16  영업부    3    1.0     2   6,840 0 days 17:30:20
19090202   권율 1993-05-05  연구부    0    3.0     1   4,750 0 days 19:50:20

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10 entries, 18030201 to 19090202
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      10 non-null     object
 1   생년월일    10 non-null     datetime64[ns]
 2   부서      10 non-null     object
 3   영어등급    10 non-null     object
 4   일본어등급   10 non-null     float64
 5   중국어등급   10 non-null     object
 6   급여      10 non-null     object
 7   초과근무    10 non-null     timedelta64[ns]
dtypes: datetime64[ns](1), float64(1), object(5), timedelta64[ns](1)
memory usage: 720.0+ bytes

In [17]:
# astype()

emp['영어등급'] = emp['영어등급'].astype(np.int32)
emp['일본어등급'] = emp['일본어등급'].astype(np.int32)
emp['중국어등급'] = emp['중국어등급'].astype(np.int32)
emp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10 entries, 18030201 to 19090202
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      10 non-null     object
 1   생년월일    10 non-null     datetime64[ns]
 2   부서      10 non-null     object
 3   영어등급    10 non-null     int32
 4   일본어등급   10 non-null     int32
 5   중국어등급   10 non-null     int32
 6   급여      10 non-null     object
 7   초과근무    10 non-null     timedelta64[ns]
dtypes: datetime64[ns](1), int32(3), object(3), timedelta64[ns](1)
memory usage: 600.0+ bytes

In [19]:
# emp['급여'] = emp.replace(',',emp['급여'], regex=True) <== 이러면 안됨

emp['급여'] = emp['급여'].replace('\,', '', regex=True).astype(np.int64)
display(emp)

           이름       생년월일   부서  영어등급  일본어등급  중국어등급     급여            초과근무
사번
18030201  임꺽정 1990-01-23  연구부     1      1      0   3456 0 days 23:10:10
18030202  손오공 1992-10-11  마케팅     0      2      0   4320 0 days 10:15:17
19030401  전우치 1995-07-02  연구부     1      0      0   5600 0 days 16:21:10
19070101  홍길동 1990-11-23  연구부     0      0      3   4500 0 days 15:00:20
19070102  사오정 1993-02-01  마케팅     0      0      0   3150 0 days 21:19:50
19070103  저팔계 1992-07-16  연구부     0      0      1   4200 0 days 14:10:40
19080101  김유신 1993-04-11  총무부     2      0      0   4800 0 days 09:50:30
19080102  강감찬 1991-12-07  영업부     1      1      1  10100 0 days 08:40:40
19090201  이순신 1992-06-16  영업부     3      1      2   6840 0 days 17:30:20
19090202   권율 1993-05-05  연구부     0      3      1   4750 0 days 19:50:20

In [41]:
s1 = df['이름']
s1

0    임꺽정
1    손오공
2    전우치
3    홍길동
4    사오정
5    저팔계
6    김유신
7    강감찬
8    이순신
9     권율
Name: 이름, dtype: object

In [42]:
s1[0]

'임꺽정'

In [44]:
df1 = df[['이름', '급여']]
df1

    이름      급여
0  임꺽정   3,456
1  손오공   4,320
2  전우치   5,600
3  홍길동   4,500
4  사오정   3,150
5  저팔계   4,200
6  김유신   4,800
7  강감찬  10,100
8  이순신   6,840
9   권율   4,750

## [ 연습 문제 ]

- email : kilah@softsociety.net 으로 제출하시오

### 1. 주어진 Seattle2014.csv 파일을 확인하고 메모리에 로드하시오

In [90]:
sea = pd.read_csv("./files/data/Seattle2014.csv")
display(sea)

,STATION,STATION_NAME,DATE,PRCP,SNWD,SNOW,TMAX,TMIN,AWND,WDF2,WDF5,WSF2,WSF5,WT01,WT05,WT02,WT03
0,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140101,0,0,0,72,33,12,340,310,36,40,-9999,-9999,-9999,-9999
1,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140102,41,0,0,106,61,32,190,200,94,116,-9999,-9999,-9999,-9999
2,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140103,15,0,0,89,28,26,30,50,63,72,1,-9999,-9999,-9999
3,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140104,0,0,0,78,6,27,40,40,45,58,1,-9999,-9999,-9999
4,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140105,0,0,0,83,-5,37,10,10,67,76,-9999,-9999,-9999,-9999
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
360,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20141227,33,0,0,94,44,49,210,210,112,161,1,-9999,-9999,-9999
361,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20141228,41,0,0,67,28,18,50,30,58,72,1,-9999,-9999,-9999
362,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20141229,0,0,0,61,6,43,350,350,76,103,1,-9999,-9999,-9999
363,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20141230,0,0,0,33,-21,36,90,70,63,76,-9999,-9999,-9999,-9999
364,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20141231,0,0,0,33,-27,30,30,-9999,58,-9999,-9999,-9999,-9999,-9999

In [52]:
sea.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 17 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   STATION       365 non-null    object
 1   STATION_NAME  365 non-null    object
 2   DATE          365 non-null    int64
 3   PRCP          365 non-null    int64
 4   SNWD          365 non-null    int64
 5   SNOW          365 non-null    int64
 6   TMAX          365 non-null    int64
 7   TMIN          365 non-null    int64
 8   AWND          365 non-null    int64
 9   WDF2          365 non-null    int64
 10  WDF5          365 non-null    int64
 11  WSF2          365 non-null    int64
 12  WSF5          365 non-null    int64
 13  WT01          365 non-null    int64
 14  WT05          365 non-null    int64
 15  WT02          365 non-null    int64
 16  WT03          365 non-null    int64
dtypes: int64(15), object(2)
memory usage: 48.6+ KB

### 2. 강우량 많은날 상위 10일 출력

In [51]:
sea.sort_values(by='PRCP', ascending=False).head(10)

,STATION,STATION_NAME,DATE,PRCP,SNWD,SNOW,TMAX,TMIN,AWND,WDF2,WDF5,WSF2,WSF5,WT01,WT05,WT02,WT03
63,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140305,467,0,0,156,106,39,190,200,112,157,1,-9999,-9999,-9999
331,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20141128,343,0,0,128,33,58,10,10,103,143,1,-9999,-9999,-9999
122,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140503,333,0,0,150,89,34,210,200,98,130,1,-9999,-9999,-9999
66,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140308,323,0,0,128,67,27,200,210,76,103,1,-9999,-9999,-9999
294,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20141022,320,0,0,156,117,50,200,130,81,125,1,-9999,-9999,-9999
74,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140316,277,0,0,106,44,38,230,240,76,103,1,-9999,-9999,-9999
46,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140216,264,0,0,94,39,79,230,220,130,183,1,-9999,-9999,-9999
302,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20141030,254,0,0,156,111,32,100,110,72,94,1,-9999,-9999,-9999
86,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140328,221,0,0,117,72,39,240,210,89,107,1,-9999,-9999,-9999
224,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140813,216,0,0,233,150,27,200,200,63,63,1,-9999,-9999,-9999

### 3. 1월의 강수량만 출력하시오

In [64]:
sea_jan = sea[sea['DATE'] < 20140200]
sea_jan

,STATION,STATION_NAME,DATE,PRCP,SNWD,SNOW,TMAX,TMIN,AWND,WDF2,WDF5,WSF2,WSF5,WT01,WT05,WT02,WT03
0,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140101,0,0,0,72,33,12,340,310,36,40,-9999,-9999,-9999,-9999
1,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140102,41,0,0,106,61,32,190,200,94,116,-9999,-9999,-9999,-9999
2,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140103,15,0,0,89,28,26,30,50,63,72,1,-9999,-9999,-9999
3,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140104,0,0,0,78,6,27,40,40,45,58,1,-9999,-9999,-9999
4,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140105,0,0,0,83,-5,37,10,10,67,76,-9999,-9999,-9999,-9999
5,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140106,3,0,0,78,-5,26,210,210,112,125,1,-9999,-9999,-9999
6,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140107,122,0,0,83,50,16,160,150,45,54,-9999,-9999,-9999,-9999
7,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140108,97,0,0,100,72,46,180,180,107,143,1,-9999,-9999,-9999
8,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140109,58,0,0,94,56,63,210,230,143,183,1,-9999,-9999,-9999
9,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140110,43,0,0,128,83,70,200,200,134,183,-9999,-9999,-9999,-9999
10,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140111,213,0,0,144,72,88,210,200,183,250,1,-9999,-9999,-9999
11,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140112,15,0,0,111,56,81,200,210,134,174,1,-9999,-9999,-9999
12,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140113,0,0,0,106,100,71,200,210,148,201,-9999,-9999,-9999,-9999
13,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140114,0,0,0,111,72,13,180,180,58,72,-9999,-9999,-9999,-9999
14,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140115,0,0,0,111,56,25,20,10,58,67,-9999,-9999,-9999,-9999
15,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140116,0,0,0,67,44,27,30,30,63,67,-9999,-9999,-9999,-9999
16,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140117,0,0,0,56,28,23,30,10,45,58,-9999,-9999,-9999,-9999
17,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140118,0,0,0,94,6,22,120,120,63,67,-9999,-9999,-9999,-9999
18,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140119,0,0,0,61,33,25,30,-9999,40,-9999,-9999,-9999,-9999,-9999
19,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140120,0,0,0,100,28,22,20,10,54,63,-9999,-9999,-9999,-9999
20,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140121,0,0,0,100,17,15,240,240,72,94,-9999,-9999,-9999,-9999
21,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140122,5,0,0,94,56,26,40,40,72,98,-9999,-9999,-9999,-9999
22,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140123,0,0,0,100,28,52,20,20,103,125,1,-9999,-9999,-9999
23,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140124,0,0,0,128,11,19,10,10,45,58,-9999,-9999,-9999,-9999
24,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140125,0,0,0,122,11,8,110,120,45,54,-9999,-9999,-9999,-9999
25,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140126,0,0,0,83,6,13,270,270,36,40,-9999,-9999,-9999,-9999
26,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140127,0,0,0,94,17,13,130,130,40,54,-9999,-9999,-9999,-9999
27,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140128,89,0,0,111,61,16,40,40,40,54,1,-9999,-9999,-9999
28,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140129,216,0,0,111,72,34,210,200,89,112,1,-9999,-9999,-9999
29,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140130,0,0,0,83,61,64,210,210,103,139,-9999,-9999,-9999,-9999
30,GHCND:USW00024233,SEATTLE TACOMA INTERNATIONAL AIRPORT WA US,20140131,23,0,0,78,56,26,200,200,67,81,1,-9999,-9999,-9999

### 4. 1년의 강수량중 40 미만으로 내린날이 몇일인지 출력하시오

In [79]:
count = len(sea.where(sea['PRCP'] < 40).value_counts())
count

277

### 5. 1월에 내린 평균 강수량

In [91]:
sea_jan['PRCP'].mean()

30.322580645161292

### 6. 2월에 내린 평균 강수량

In [89]:
sea_feb = sea[(sea['DATE'] >= 20140200) & (sea['DATE'] < 20140300)]
sea_feb['PRCP'].mean()

55.42857142857143

##### Basic Indexing of Series

##### Basic Indexing of DataFrame